{
  "4935": {
    "title": "Howl's Moving Castle",
    "year": "2004-09-09",
    "poster": "https://image.tmdb.org/t/p/w500/13kOl2v0nD2OLbVSHnHk8GUFEhO.jpg",
    "genres": [
      "Fantasy",
      "Animation",
      "Adventure"
    ],
    "overview": "Sophie, a young milliner, is turned into an elderly woman by a witch who enters her shop and curses her. She encounters a wizard named Howl and gets caught up in his resistance to fighting for the king."
  },
  "72190": {
    "title": "World War Z",
    "year": "2013-06-19",
    "poster": "https://image.tmdb.org/t/p/w500/aCnVdvExw6UWSeQfr0tUH3jr4qG.jpg",
    "genres": [
      "Action",
      "Horror",
      "Science Fiction",
      "Thriller"
    ],
    "overview": "Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls."
  },
  "603": {
    "title": "The Matrix",
    "year": "1999-03-31",
    "poster": "https://image.tmdb.org/t/p/w500/p96dm7sCMn4VYAStA6siNz30G1r.jpg",
    "genres": [
      "Action",
      "Science Fiction"
    ],
    "overview": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth."
  },
  "592831": {
    "title": "Megalopolis",
    "year": "2024-09-25",
    "poster": "https://image.tmdb.org/t/p/w500/8Sok3HNA3r1GHnK2lCytHyBz1A.jpg",
    "genres": [
      "Science Fiction",
      "Drama",
      "Fantasy"
    ],
    "overview": "In a futuristic New York known as New Rome, visionary architect Cesar Catilina dreams of building \"Megalopolis,\" a utopian city that redefines society’s limits. Opposing him is the corrupt Mayor Franklyn Cicero, who clings to power and profit. Between them stands Julia, the mayor’s daughter, whose love for Cesar forces her to choose between loyalty, ambition, and the fate of humanity."
  },
  "49046": {
    "title": "All Quiet on the Western Front",
    "year": "2022-10-07",
    "poster": "https://image.tmdb.org/t/p/w500/2IRjbi9cADuDMKmHdLK7LaqQDKA.jpg",
    "genres": [
      "War",
      "History",
      "Drama"
    ],
    "overview": "Paul Baumer and his friends Albert and Muller, egged on by romantic dreams of heroism, voluntarily enlist in the German army. Full of excitement and patriotic fervour, the boys enthusiastically march into a war they believe in. But once on the Western Front, they discover the soul-destroying horror of World War I."
  },
  "76": {
    "title": "Before Sunrise",
    "year": "1995-01-27",
    "poster": "https://image.tmdb.org/t/p/w500/kf1Jb1c2JAOqjuzA3H4oDM263uB.jpg",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "An unexpected meeting on a train leads two travelers to spend an evening wandering through Vienna. As the night unfolds, they share stories and conversations about life and love, exploring new ideas while a quiet intimacy grows between them, knowing it may be their only night together."
  },
  "1054867": {
    "title": "One Battle After Another",
    "year": "2025-09-23",
    "poster": "https://image.tmdb.org/t/p/w500/m1jFoahEbeQXtx4zArT2FKdbNIj.jpg",
    "genres": [
      "Thriller",
      "Crime",
      "Action"
    ],
    "overview": "Washed-up revolutionary Bob exists in a state of stoned paranoia, surviving off-grid with his spirited, self-reliant daughter, Willa. When his evil nemesis resurfaces after 16 years and she goes missing, the former radical scrambles to find her, father and daughter both battling the consequences of his past."
  },
  "25934": {
    "title": "To Sir, with Love",
    "year": "1967-06-14",
    "poster": "https://image.tmdb.org/t/p/w500/xMaVwTfgETmPs5yp3lNK5SeWCtB.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "A British Guianese engineer starts a job as a high school teacher in London’s East End, where his uninterested and delinquent pupils are in desperate need of attention and care."
  },
  "49517": {
    "title": "Tinker Tailor Soldier Spy",
    "year": "2011-09-16",
    "poster": "https://image.tmdb.org/t/p/w500/e0dZ7TapGY9HtJ9xk1TUHPEOccl.jpg",
    "genres": [
      "Drama",
      "Thriller",
      "Mystery"
    ],
    "overview": "In the bleak days of the Cold War, espionage veteran George Smiley is forced from semi-retirement to uncover a Soviet mole within his former colleagues at the heart of MI6."
  },
  "146": {
    "title": "Crouching Tiger, Hidden Dragon",
    "year": "2000-07-06",
    "poster": "https://image.tmdb.org/t/p/w500/iNDVBFNz4XyYzM9Lwip6atSTFqf.jpg",
    "genres": [
      "Adventure",
      "Drama",
      "Action",
      "Romance"
    ],
    "overview": "Two warriors in pursuit of a stolen sword and a notorious fugitive are led to an impetuous, physically-skilled, teenage nobleman's daughter, who is at a crossroads in her life."
  },
  "11216": {
    "title": "Cinema Paradiso",
    "year": "1988-11-17",
    "poster": "https://image.tmdb.org/t/p/w500/gCI2AeMV4IHSewhJkzsur5MEp6R.jpg",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "A filmmaker recalls his childhood, when he fell in love with the movies at his village's theater and formed a deep friendship with the theater's projectionist."
  },
  "1018": {
    "title": "Mulholland Drive",
    "year": "2001-06-06",
    "poster": "https://image.tmdb.org/t/p/w500/x7A59t6ySylr1L7aubOQEA480vM.jpg",
    "genres": [
      "Thriller",
      "Drama",
      "Mystery"
    ],
    "overview": "Blonde Betty Elms has only just arrived in Hollywood to become a movie star when she meets an enigmatic brunette with amnesia. Meanwhile, as the two set off to solve the second woman's identity, filmmaker Adam Kesher runs into ominous trouble while casting his latest project."
  },
  "980026": {
    "title": "The Promised Land",
    "year": "2023-10-05",
    "poster": "https://image.tmdb.org/t/p/w500/okVwls2laPGOsLKKhXQCEiTBwpw.jpg",
    "genres": [
      "Action",
      "Drama",
      "History"
    ],
    "overview": "Denmark, 1755. Captain Ludvig Kahlen sets out to conquer a Danish heath reputed to be uncultivable, with an impossible goal: to establish a colony in the name of the king, in exchange for a royal title. A single-minded ambition that the ruthless lord of the region will relentlessly seek to put down. Kahlen's fate hangs in the balance: will his endevours bring him wealth and honour, or cost him his life...?"
  },
  "641": {
    "title": "Requiem for a Dream",
    "year": "2000-10-06",
    "poster": "https://image.tmdb.org/t/p/w500/nOd6vjEmzCT0k4VYqsA2hwyi87C.jpg",
    "genres": [
      "Crime",
      "Drama"
    ],
    "overview": "The drug-induced utopias of four Coney Island residents are shattered when their addictions run deep."
  },
  "258480": {
    "title": "Carol",
    "year": "2015-11-20",
    "poster": "https://image.tmdb.org/t/p/w500/cJeled7EyPdur6TnCA5GYg0UVna.jpg",
    "genres": [
      "Romance",
      "Drama"
    ],
    "overview": "In 1950s New York, a department-store clerk who dreams of a better life falls for an older, married woman."
  },
  "1124566": {
    "title": "Sentimental Value",
    "year": "2025-08-20",
    "poster": "https://image.tmdb.org/t/p/w500/pz9NCWxxOk3o0W3v1Zkhawrwb4i.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "Sisters Nora and Agnes reunite with their estranged father, the charismatic Gustav, a once-renowned director who offers stage actress Nora a role in what he hopes will be his comeback film. When Nora turns it down, she soon discovers he has given her part to an eager young Hollywood star."
  },
  "718930": {
    "title": "Bullet Train",
    "year": "2022-08-03",
    "poster": "https://image.tmdb.org/t/p/w500/j8szC8OgrejDQjjMKSVXyaAjw3V.jpg",
    "genres": [
      "Action",
      "Comedy",
      "Thriller"
    ],
    "overview": "Unlucky assassin Ladybug is determined to do his job peacefully after one too many gigs gone off the rails. Fate, however, may have other plans, as Ladybug's latest mission puts him on a collision course with lethal adversaries from around the globe—all with connected, yet conflicting, objectives—on the world's fastest train."
  },
  "10363": {
    "title": "Purple Noon",
    "year": "1960-03-10",
    "poster": "https://image.tmdb.org/t/p/w500/xGVRU34izQwG8YQNfVOSfKPhD3S.jpg",
    "genres": [
      "Crime",
      "Drama",
      "Thriller"
    ],
    "overview": "Tom Ripley is a talented mimic, moocher, forger and all-around criminal improviser; but there's more to Tom Ripley than even he can guess."
  },
  "911430": {
    "title": "F1",
    "year": "2025-06-25",
    "poster": "https://image.tmdb.org/t/p/w500/vqBmyAj0Xm9LnS1xe1MSlMAJyHq.jpg",
    "genres": [
      "Action",
      "Drama"
    ],
    "overview": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory."
  },
  "670": {
    "title": "Oldboy",
    "year": "2003-11-21",
    "poster": "https://image.tmdb.org/t/p/w500/pWDtjs568ZfOTMbURQBYuT4Qxka.jpg",
    "genres": [
      "Drama",
      "Thriller",
      "Mystery",
      "Action"
    ],
    "overview": "With no clue how he came to be imprisoned, drugged and tortured for 15 years, a desperate man seeks revenge on his captors."
  },
  "792307": {
    "title": "Poor Things",
    "year": "2023-12-07",
    "poster": "https://image.tmdb.org/t/p/w500/kCGlIMHnOm8JPXq3rXM6c5wMxcT.jpg",
    "genres": [
      "Science Fiction",
      "Romance",
      "Comedy"
    ],
    "overview": "Brought back to life by an unorthodox scientist, a young woman runs off with a lawyer on a whirlwind adventure across the continents. Free from the prejudices of her times, she grows steadfast in her purpose to stand for equality and liberation."
  },
  "840": {
    "title": "Close Encounters of the Third Kind",
    "year": "1977-12-14",
    "poster": "https://image.tmdb.org/t/p/w500/gCWPB8cF82tqzrS9tvzcO6q6nyz.jpg",
    "genres": [
      "Science Fiction",
      "Drama"
    ],
    "overview": "After an encounter with UFOs, an electricity linesman feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen."
  },
  "37181": {
    "title": "About Elly",
    "year": "2009-06-06",
    "poster": "https://image.tmdb.org/t/p/w500/ctLrMQrg3kss2JO7OIr7RVdN5an.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "The mysterious disappearance of a kindergarten teacher during a picnic in the north of Iran is followed by a series of misadventures for her fellow travelers."
  },
  "100592": {
    "title": "The Hand",
    "year": "1965-10-26",
    "poster": "https://image.tmdb.org/t/p/w500/83YdjKErufydzHqvJgyY5D7EUme.jpg",
    "genres": [
      "Animation",
      "Horror"
    ],
    "overview": "A happy little potter is approached by a huge hand which wants him to sculpt its statue. The potter refuses, wanting nothing more than to be left alone with his only friend, a potted plant. As the hand's request gives way to bribery, demands, and threats, the potter becomes more desperate to escape its clutch, leading to tragedy."
  },
  "1495": {
    "title": "Kingdom of Heaven",
    "year": "2005-05-03",
    "poster": "https://image.tmdb.org/t/p/w500/rNaBe4TwbMef71sgscqabpGKsxh.jpg",
    "genres": [
      "Drama",
      "Action",
      "Adventure",
      "History",
      "War"
    ],
    "overview": "After his wife dies, a blacksmith named Balian is thrust into royalty, political intrigue and bloody holy wars during the Crusades."
  },
  "389": {
    "title": "12 Angry Men",
    "year": "1957-04-10",
    "poster": "https://image.tmdb.org/t/p/w500/ow3wq89wM8qd5X7hWKxiRfsFf9C.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young Spanish-American is guilty or innocent of murdering his father. What begins as an open and shut case soon becomes a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other."
  },
  "375315": {
    "title": "The Salesman",
    "year": "2016-06-24",
    "poster": "https://image.tmdb.org/t/p/w500/x4PIuYU5ZMMXiTrheNR8vCTYPBf.jpg",
    "genres": [
      "Drama",
      "Thriller"
    ],
    "overview": "Forced out of their apartment due to dangerous works on a neighboring building, Emad and Rana move into a new flat in the center of Tehran. An incident linked to the previous tenant will dramatically change the young couple’s life."
  },
  "13090": {
    "title": "Sunshine Cleaning",
    "year": "2008-01-18",
    "poster": "https://image.tmdb.org/t/p/w500/xwtJyfme086wcz9MXpP0i5Hrgxy.jpg",
    "genres": [
      "Comedy",
      "Drama"
    ],
    "overview": "A single mother and her slacker sister find an unexpected way to turn their lives around in this off-beat dramatic comedy. In order to raise the tuition to send her young son to private school the mom starts an unusual business – a biohazard removal/crime scene clean-up service."
  },
  "8051": {
    "title": "Punch-Drunk Love",
    "year": "2002-10-11",
    "poster": "https://image.tmdb.org/t/p/w500/htYp4yqFu4rzBEIa6j9jP8miDm3.jpg",
    "genres": [
      "Romance",
      "Drama",
      "Comedy"
    ],
    "overview": "A socially awkward and volatile small business owner meets the love of his life after being threatened by a gang of scammers."
  },
  "716668": {
    "title": "Twins in Paradise",
    "year": "2024-11-08",
    "poster": "https://image.tmdb.org/t/p/w500/ybfp4gjvsSZbJBQJR6r2JLss1z9.jpg",
    "genres": [
      "Animation",
      "Drama"
    ],
    "overview": "Twin girls cope with the pressure of tennis stardom and the absence of their mother in an unstable society."
  },
  "49565": {
    "title": "The Man Who Planted Trees",
    "year": "1987-05-13",
    "poster": "https://image.tmdb.org/t/p/w500/tEzdXghDipM4b8Qs1mzt4mvXT6l.jpg",
    "genres": [
      "Animation",
      "Drama",
      "Fantasy"
    ],
    "overview": "The story of one shepherd's single-handed quest to re-forest a desolate valley in the foothills of the French Alps throughout the first half of the 20th century."
  },
  "1422": {
    "title": "The Departed",
    "year": "2006-10-04",
    "poster": "https://image.tmdb.org/t/p/w500/nT97ifVT2J1yMQmeq20Qblg61T.jpg",
    "genres": [
      "Drama",
      "Thriller",
      "Crime"
    ],
    "overview": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them."
  },
  "20722": {
    "title": "La Maison en Petits Cubes",
    "year": "2008-06-10",
    "poster": "https://image.tmdb.org/t/p/w500/kNGiHnbAToF1iIkN2kOTCEEXtAc.jpg",
    "genres": [
      "Animation"
    ],
    "overview": "La Maison en Petits Cubes tells the story of a grandfather's memories as he adds more blocks to his house to stem the flooding waters."
  },
  "132344": {
    "title": "Before Midnight",
    "year": "2013-04-05",
    "poster": "https://image.tmdb.org/t/p/w500/qbGKJmNUroDz75kh5Oafoall89e.jpg",
    "genres": [
      "Romance",
      "Drama"
    ],
    "overview": "It has been nine years since we last met Jesse and Celine, the French-American couple who once met on a train in Vienna. They now live in Paris with twin daughters but have spent a summer in Greece at the invitation of an author colleague of Jesse's. When the vacation is over and Jesse must send his teenage son off to the States, he begins to question his life decisions, and his relationship with Celine is at risk."
  },
  "1160360": {
    "title": "If I Had Legs I'd Kick You",
    "year": "2025-10-10",
    "poster": "https://image.tmdb.org/t/p/w500/va0TQ9WprMXRqQAzY56vyqY0Yd5.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "With her life crashing down around her, Linda attempts to navigate her child's mysterious illness, her absent husband, a missing person, and an increasingly hostile relationship with her therapist."
  },
  "889699": {
    "title": "Holy Spider",
    "year": "2022-07-13",
    "poster": "https://image.tmdb.org/t/p/w500/6ObJ4x7m1F5QRY06WzOxNJQHwGb.jpg",
    "genres": [
      "Thriller",
      "Drama",
      "Crime",
      "Horror"
    ],
    "overview": "A journalist descends into the dark underbelly of the Iranian holy city of Mashhad as she investigates the serial killings of sex workers by the so called \"Spider Killer\", who believes he is cleansing the streets of sinners."
  },
  "8329": {
    "title": "[REC]",
    "year": "2007-11-23",
    "poster": "https://image.tmdb.org/t/p/w500/hgyJR4sgMsee6xMFM3xYiG6cDCh.jpg",
    "genres": [
      "Horror",
      "Mystery"
    ],
    "overview": "A television reporter and cameraman follow emergency workers into a dark apartment building and are quickly locked inside with something terrifying."
  },
  "694": {
    "title": "The Shining",
    "year": "1980-05-23",
    "poster": "https://image.tmdb.org/t/p/w500/uAR0AWqhQL1hQa69UDEbb2rE5Wx.jpg",
    "genres": [
      "Horror",
      "Thriller"
    ],
    "overview": "Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within."
  },
  "180": {
    "title": "Minority Report",
    "year": "2002-06-20",
    "poster": "https://image.tmdb.org/t/p/w500/qtgFcnwh9dAFLocsDk2ySDVS8UF.jpg",
    "genres": [
      "Science Fiction",
      "Action",
      "Thriller"
    ],
    "overview": "John Anderton is a top 'Precrime' cop in the late-21st century, when technology can predict crimes before they're committed. But Anderton becomes the quarry when another investigator targets him for a murder charge."
  },
  "377": {
    "title": "A Nightmare on Elm Street",
    "year": "1984-11-09",
    "poster": "https://image.tmdb.org/t/p/w500/avHGIO93jgCZLf33ec2aahgZJX6.jpg",
    "genres": [
      "Horror"
    ],
    "overview": "Teenagers in a small town are dropping like flies, apparently in the grip of mass hysteria causing their suicides. A cop's daughter, Nancy Thompson, traces the cause to child molester Fred Krueger, who was burned alive by angry parents many years before. Krueger has now come back in the dreams of his killers' children, claiming their lives as his revenge. Nancy and her boyfriend, Glen, must devise a plan to lure the monster out of the realm of nightmares and into the real world..."
  },
  "77": {
    "title": "Memento",
    "year": "2000-10-11",
    "poster": "https://image.tmdb.org/t/p/w500/fKTPH2WvH8nHTXeBYBVhawtRqtR.jpg",
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "overview": "Leonard Shelby is tracking down the man who raped and murdered his wife. The difficulty of locating his wife's killer, however, is compounded by the fact that he suffers from a rare, untreatable form of short-term memory loss. Although he can recall details of life before his accident, Leonard cannot remember what happened fifteen minutes ago, where he's going, or why."
  },
  "583794": {
    "title": "Law of Tehran",
    "year": "2019-03-17",
    "poster": "https://image.tmdb.org/t/p/w500/ujNhy2Vu7S1FHuwePMIYMkIbGTj.jpg",
    "genres": [
      "Action",
      "Crime",
      "Drama"
    ],
    "overview": "Samad is nobody’s fool. The narcotics officer has seen his share of a drug dealer’s lies and games, and his patience has come to run thin. While searching for the infamous drug baron Nasser Khakzad, he and his colleague Hamid scour the streets of Tehran, turning an overcrowded prison on its head. With his rough and dubious approach, Samad finally manages to find the criminal’s whereabouts – but things do not quite go according to plan..."
  },
  "237791": {
    "title": "The Way He Looks",
    "year": "2014-04-10",
    "poster": "https://image.tmdb.org/t/p/w500/2BhhlAYwKvONGW7tr16ZhnD0sym.jpg",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "Leonardo is a blind teenager dealing with an overprotective mother while trying to live a more independent life. To the disappointment of his best friend, Giovana, he plans to go on an exchange program abroad. When Gabriel, a new student in town, arrives at their classroom, new feelings blossom in Leonardo making him question his plans."
  },
  "499": {
    "title": "Cléo from 5 to 7",
    "year": "1962-04-11",
    "poster": "https://image.tmdb.org/t/p/w500/oelBStY4xpguaplRv15P3Za7Xsr.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "Agnès Varda eloquently captures Paris in the sixties with this real-time portrait of a singer set adrift in the city as she awaits test results of a biopsy. A chronicle of the minutes of one woman’s life, Cléo from 5 to 7 is a spirited mix of vivid vérité and melodrama, featuring a score by Michel Legrand and cameos by Jean-Luc Godard and Anna Karina."
  },
  "775": {
    "title": "A Trip to the Moon",
    "year": "1902-06-15",
    "poster": "https://image.tmdb.org/t/p/w500/9o0v5LLFk51nyTBHZSre6OB37n2.jpg",
    "genres": [
      "Adventure",
      "Science Fiction",
      "Fantasy"
    ],
    "overview": "Professor Barbenfouillis and five of his colleagues from the Academy of Astronomy travel to the Moon aboard a rocket propelled by a giant cannon. Once on the lunar surface, the bold explorers face the many perils hidden in the caves of the mysterious planet."
  },
  "10997": {
    "title": "Farewell My Concubine",
    "year": "1993-01-01",
    "poster": "https://image.tmdb.org/t/p/w500/iJ99VEPZ8aZTGm18DN6RfZCxYwk.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "In an epic tale of theater, gender, love and class, two Beijing opera actors navigate political turmoil as their friendship evolves over decades."
  },
  "745": {
    "title": "The Sixth Sense",
    "year": "1999-08-06",
    "poster": "https://image.tmdb.org/t/p/w500/vOyfUXNFSnaTk7Vk5AjpsKTUWsu.jpg",
    "genres": [
      "Mystery",
      "Thriller",
      "Drama"
    ],
    "overview": "Following an unexpected tragedy, child psychologist Malcolm Crowe meets a nine year old boy named Cole Sear, who is hiding a dark secret."
  },
  "489412": {
    "title": "It's Such a Beautiful Day",
    "year": "2012-08-24",
    "poster": "https://image.tmdb.org/t/p/w500/hop0dsM4nxyNENGhBhpJWTCJ5rS.jpg",
    "genres": [
      "Animation",
      "Comedy"
    ],
    "overview": "Bill struggles to put together his shattered psyche."
  },
  "598": {
    "title": "City of God",
    "year": "2002-08-30",
    "poster": "https://image.tmdb.org/t/p/w500/k7eYdWvhYQyRQoU2TB2A2Xu2TfD.jpg",
    "genres": [
      "Drama",
      "Crime"
    ],
    "overview": "In the poverty-stricken favelas of Rio de Janeiro in the 1970s, two young men choose different paths. Rocket is a budding photographer who documents the increasing drug-related violence of his neighborhood, while José “Zé” Pequeno is an ambitious drug dealer diving into a dangerous life of crime."
  },
  "502033": {
    "title": "Sound of Metal",
    "year": "2020-11-20",
    "poster": "https://image.tmdb.org/t/p/w500/3178oOJKKPDeQ2legWQvMPpllv.jpg",
    "genres": [
      "Drama",
      "Music"
    ],
    "overview": "Metal drummer Ruben begins to lose his hearing. When a doctor tells him his condition will worsen, he thinks his career and life is over. His girlfriend Lou checks the former addict into a rehab for the deaf hoping it will prevent a relapse and help him adapt to his new life. After being welcomed and accepted just as he is, Ruben must choose between his new normal and the life he once knew."
  },
  "9504": {
    "title": "Glengarry Glen Ross",
    "year": "1992-09-10",
    "poster": "https://image.tmdb.org/t/p/w500/nGZCeCfNseq1ee3cJLBp0rH0djT.jpg",
    "genres": [
      "Crime",
      "Drama",
      "Mystery"
    ],
    "overview": "Times are tough at Premiere Properties. Shelley \"the machine\" Levene and Dave Moss are veteran salesmen, but only Ricky Roma is on a hot streak. The new Glengarry sales leads could turn everything around, but the front office is holding them back until these \"losers\" prove themselves. Then someone decides to take matters into his own hands, stealing the Glengarry leads and leaving everyone wondering who did it."
  },
  "786892": {
    "title": "Furiosa: A Mad Max Saga",
    "year": "2024-05-22",
    "poster": "https://image.tmdb.org/t/p/w500/iADOJ8Zymht2JPMoy3R7xceZprc.jpg",
    "genres": [
      "Action",
      "Science Fiction",
      "Adventure"
    ],
    "overview": "As the world falls, young Furiosa is snatched from the Green Place of Many Mothers into the hands of a great biker horde led by the warlord Dementus. Sweeping through the wasteland, they encounter the citadel presided over by Immortan Joe. The two tyrants wage war for dominance, and Furiosa must survive many trials as she puts together the means to find her way home."
  },
  "396535": {
    "title": "Train to Busan",
    "year": "2016-07-20",
    "poster": "https://image.tmdb.org/t/p/w500/vNVFt6dtcqnI7hqa6LFBUibuFiw.jpg",
    "genres": [
      "Horror",
      "Thriller",
      "Action",
      "Adventure"
    ],
    "overview": "When a zombie virus pushes Korea into a state of emergency, those trapped on an express train to Busan must fight for their own survival."
  },
  "785084": {
    "title": "The Whale",
    "year": "2022-12-09",
    "poster": "https://image.tmdb.org/t/p/w500/jQ0gylJMxWSL490sy0RrPj1Lj7e.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "A reclusive English teacher suffering from severe obesity attempts to reconnect with his estranged teenage daughter for one last chance at redemption."
  },
  "303867": {
    "title": "World of Tomorrow",
    "year": "2015-01-22",
    "poster": "https://image.tmdb.org/t/p/w500/5s7DSOek7Bk2CvcG1zX01bJzJ0x.jpg",
    "genres": [
      "Animation",
      "Drama",
      "Science Fiction"
    ],
    "overview": "A little girl is taken on a mind-bending tour of her distant future."
  },
  "974576": {
    "title": "Conclave",
    "year": "2024-10-25",
    "poster": "https://image.tmdb.org/t/p/w500/vYEyxF1UT779RiEalpMjUT6kfdf.jpg",
    "genres": [
      "Drama",
      "Thriller"
    ],
    "overview": "After the unexpected death of the Pope, Cardinal Lawrence is tasked with managing the covert and ancient ritual of electing a new one. Sequestered in the Vatican with the Catholic Church’s most powerful leaders until the process is complete, Lawrence finds himself at the center of a conspiracy that could lead to its downfall."
  },
  "1062722": {
    "title": "Frankenstein",
    "year": "2025-10-17",
    "poster": "https://image.tmdb.org/t/p/w500/g4JtvGlQO7DByTI6frUobqvSL3R.jpg",
    "genres": [
      "Drama",
      "Fantasy",
      "Horror"
    ],
    "overview": "Dr. Victor Frankenstein, a brilliant but egotistical scientist, brings a creature to life in a monstrous experiment that ultimately leads to the undoing of both the creator and his tragic creation."
  },
  "5176": {
    "title": "3:10 to Yuma",
    "year": "2007-09-06",
    "poster": "https://image.tmdb.org/t/p/w500/voMB69AsLnPNmtfbrBl0lbeFKDH.jpg",
    "genres": [
      "Western"
    ],
    "overview": "In Arizona in the late 1800s, infamous outlaw Ben Wade and his vicious gang of thieves and murderers have plagued the Southern Railroad. When Wade is captured, Civil War veteran Dan Evans, struggling to survive on his drought-plagued ranch, volunteers to deliver him alive to the \"3:10 to Yuma\", a train that will take the killer to trial."
  },
  "115": {
    "title": "The Big Lebowski",
    "year": "1998-03-06",
    "poster": "https://image.tmdb.org/t/p/w500/9mprbw31MGdd66LR0AQKoDMoFRv.jpg",
    "genres": [
      "Comedy",
      "Crime"
    ],
    "overview": "Jeffrey 'The Dude' Lebowski, a Los Angeles slacker who only wants to bowl and drink White Russians, is mistaken for another Jeffrey Lebowski, a wheelchair-bound millionaire, and finds himself dragged into a strange series of events involving nihilists, adult film producers, ferrets, errant toes, and large sums of money."
  },
  "80": {
    "title": "Before Sunset",
    "year": "2004-06-16",
    "poster": "https://image.tmdb.org/t/p/w500/gycdE1ARByGQcK4fYR2mgpU6OO.jpg",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "Nine years later, Jesse travels across Europe giving readings from a book he wrote about the night he spent in Vienna with Celine. After his reading in Paris, Celine finds him, and they spend part of the day together before Jesse has to again leave for a flight. They are both in relationships now, and Jesse has a son, but as their strong feelings for each other start to return, both confess a longing for more."
  },
  "571": {
    "title": "The Birds",
    "year": "1963-03-28",
    "poster": "https://image.tmdb.org/t/p/w500/eClg8QPg8mwB6INIC4pyR5pAbDr.jpg",
    "genres": [
      "Horror",
      "Thriller"
    ],
    "overview": "Thousands of birds flock into a seaside town and terrorize the residents in a series of deadly attacks."
  },
  "103663": {
    "title": "The Hunt",
    "year": "2012-10-25",
    "poster": "https://image.tmdb.org/t/p/w500/jkixsXzRh28q3PCqFoWcf7unghT.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "A teacher lives a lonely life, all the while struggling over his son’s custody. His life slowly gets better as he finds love and receives good news from his son, but his new luck is about to be brutally shattered by an innocent little lie."
  },
  "70": {
    "title": "Million Dollar Baby",
    "year": "2004-12-05",
    "poster": "https://image.tmdb.org/t/p/w500/jcfEqKdWF1zeyvECPqp3mkWLct2.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "Despondent over a painful estrangement from his daughter, trainer Frankie Dunn isn't prepared for boxer Maggie Fitzgerald to enter his life. But Maggie's determined to go pro and to convince Dunn and his cohort to help her."
  },
  "2898": {
    "title": "As Good as It Gets",
    "year": "1997-12-19",
    "poster": "https://image.tmdb.org/t/p/w500/xXxuJPNUDZ0vjsAXca0O5p3leVB.jpg",
    "genres": [
      "Drama",
      "Comedy",
      "Romance"
    ],
    "overview": "A misanthropic author, a single mother and waitress, and a gay artist form an unlikely friendship after the artist is assaulted in a robbery."
  },
  "152584": {
    "title": "Blue Is the Warmest Color",
    "year": "2013-10-09",
    "poster": "https://image.tmdb.org/t/p/w500/kgUk1wti2cvrptIgUz0VTAtSF6w.jpg",
    "genres": [
      "Romance",
      "Drama"
    ],
    "overview": "Adèle's life is changed when she meets Emma, a young woman with blue hair, who will allow her to discover desire, to assert herself as a woman and as an adult. In front of others, Adele grows, seeks herself, loses herself, finds herself."
  },
  "128": {
    "title": "Princess Mononoke",
    "year": "1997-07-12",
    "poster": "https://image.tmdb.org/t/p/w500/cMYCDADoLKLbB83g4WnJegaZimC.jpg",
    "genres": [
      "Adventure",
      "Fantasy",
      "Animation"
    ],
    "overview": "Ashitaka, a prince of the disappearing Emishi people, is cursed by a demonized boar god and must journey to the west to find a cure. Along the way, he encounters San, a young human woman fighting to protect the forest, and Lady Eboshi, who is trying to destroy it. Ashitaka must find a way to bring balance to this conflict."
  },
  "805": {
    "title": "Rosemary's Baby",
    "year": "1968-06-12",
    "poster": "https://image.tmdb.org/t/p/w500/uYgvlHceRFjAFbsNeMInYcLZLUb.jpg",
    "genres": [
      "Drama",
      "Horror",
      "Thriller"
    ],
    "overview": "A young couple, Rosemary and Guy, moves into an infamous New York apartment building, known by frightening legends and mysterious events, with the purpose of starting a family."
  },
  "531428": {
    "title": "Portrait of a Lady on Fire",
    "year": "2019-09-06",
    "poster": "https://image.tmdb.org/t/p/w500/2LquGwEhbg3soxSCs9VNyh5VJd9.jpg",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "On an isolated island in Brittany at the end of the eighteenth century, a female painter is obliged to paint a wedding portrait of a young woman."
  },
  "857": {
    "title": "Saving Private Ryan",
    "year": "1998-07-24",
    "poster": "https://image.tmdb.org/t/p/w500/uqx37cS8cpHg8U35f9U5IBlrCV3.jpg",
    "genres": [
      "War",
      "Drama",
      "History"
    ],
    "overview": "As U.S. troops storm the beaches of Normandy, three brothers lie dead on the battlefield, with a fourth trapped behind enemy lines. Ranger captain John Miller and seven men are tasked with penetrating German-held territory and bringing the boy home."
  },
  "7299": {
    "title": "Equilibrium",
    "year": "2002-12-06",
    "poster": "https://image.tmdb.org/t/p/w500/yQuovle5Ov6q69XSdTNdH52eANc.jpg",
    "genres": [
      "Action",
      "Science Fiction",
      "Thriller"
    ],
    "overview": "In a dystopian future, a totalitarian regime maintains peace by subduing the populace with a drug, and displays of emotion are punishable by death. A man in charge of enforcing the law rises to overthrow the system."
  },
  "361743": {
    "title": "Top Gun: Maverick",
    "year": "2022-05-21",
    "poster": "https://image.tmdb.org/t/p/w500/62HCnUTziyWcpDaBO2i1DX17ljH.jpg",
    "genres": [
      "Action",
      "Drama"
    ],
    "overview": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen."
  },
  "15265": {
    "title": "The Red Balloon",
    "year": "1956-08-24",
    "poster": "https://image.tmdb.org/t/p/w500/3XrEggEOEnKGi8hTOau44vcvbmV.jpg",
    "genres": [
      "Comedy",
      "Drama",
      "Family",
      "Fantasy"
    ],
    "overview": "A young boy discovers a stray balloon, which seems to have a mind of its own, on the streets of Paris. The two become inseparable, yet the world’s harsh realities finally interfere."
  },
  "335984": {
    "title": "Blade Runner 2049",
    "year": "2017-10-04",
    "poster": "https://image.tmdb.org/t/p/w500/gajva2L0rPYkEWjzgFlBXCAVBE5.jpg",
    "genres": [
      "Science Fiction",
      "Drama"
    ],
    "overview": "Thirty years after the events of the first film, a new blade runner, LAPD Officer K, unearths a long-buried secret that has the potential to plunge what's left of society into chaos. K's discovery leads him on a quest to find Rick Deckard, a former LAPD blade runner who has been missing for 30 years."
  },
  "593643": {
    "title": "The Menu",
    "year": "2022-11-17",
    "poster": "https://image.tmdb.org/t/p/w500/fPtUgMcLIboqlTlPrq0bQpKK8eq.jpg",
    "genres": [
      "Comedy",
      "Horror",
      "Thriller"
    ],
    "overview": "A young couple travels to a remote island to eat at an exclusive restaurant where the chef has prepared a lavish menu, with some shocking surprises."
  },
  "1456349": {
    "title": "It Was Just an Accident",
    "year": "2025-09-27",
    "poster": "https://image.tmdb.org/t/p/w500/eNYGj2DG3n8OrVPTfYunpPW9uas.jpg",
    "genres": [
      "Drama",
      "Thriller",
      "Crime"
    ],
    "overview": "An unassuming mechanic is reminded of his time in an Iranian prison when he encounters a man he suspects to be his sadistic jailhouse captor."
  },
  "11104": {
    "title": "Chungking Express",
    "year": "1994-07-14",
    "poster": "https://image.tmdb.org/t/p/w500/43I9DcNoCzpyzK8JCkJYpHqHqGG.jpg",
    "genres": [
      "Drama",
      "Comedy",
      "Romance"
    ],
    "overview": "Two melancholic Hong Kong policemen fall in love: one with a mysterious underworld figure, the other with a beautiful and ethereal server at a late-night restaurant."
  },
  "803700": {
    "title": "The Eight Mountains",
    "year": "2022-12-21",
    "poster": "https://image.tmdb.org/t/p/w500/ohD87uTlwOgNuUEYaW82ew9Eds7.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "An epic journey of friendship and self-discovery set in the breathtaking Italian Alps, The Eight Mountains follows over four decades the profound, complex relationship between Pietro and Bruno."
  },
  "582": {
    "title": "The Lives of Others",
    "year": "2006-03-23",
    "poster": "https://image.tmdb.org/t/p/w500/cVUDMnskSc01rdbyH0tLATTJUdP.jpg",
    "genres": [
      "Drama",
      "Thriller"
    ],
    "overview": "In 1984 East Berlin, dedicated Stasi officer Gerd Wiesler begins spying on a famous playwright and his actress-lover Christa-Maria. Wiesler becomes unexpectedly sympathetic to the couple, and faces conflicting loyalties when his superior takes a liking to Christa-Maria."
  },
  "619730": {
    "title": "Don't Worry Darling",
    "year": "2022-09-21",
    "poster": "https://image.tmdb.org/t/p/w500/jOqxKIOC92BVyinYO1Fm73XY7Tc.jpg",
    "genres": [
      "Science Fiction",
      "Mystery",
      "Thriller"
    ],
    "overview": "Alice and Jack are lucky to be living in the idealized community of Victory, the experimental company town housing the men who work for the top-secret Victory Project and their families. But when cracks in their idyllic life begin to appear, exposing flashes of something much more sinister lurking beneath the attractive façade, Alice can’t help questioning exactly what they’re doing in Victory, and why."
  },
  "6977": {
    "title": "No Country for Old Men",
    "year": "2007-11-09",
    "poster": "https://image.tmdb.org/t/p/w500/6d5XOczc226jECq0LIX0siKtgHR.jpg",
    "genres": [
      "Crime",
      "Thriller",
      "Western"
    ],
    "overview": "Llewelyn Moss stumbles upon dead bodies, $2 million and a hoard of heroin in a Texas desert, but methodical killer Anton Chigurh comes looking for it, with local sheriff Ed Tom Bell hot on his trail. The roles of prey and predator blur as the violent pursuit of money and justice collide."
  },
  "87827": {
    "title": "Life of Pi",
    "year": "2012-11-20",
    "poster": "https://image.tmdb.org/t/p/w500/iLgRu4hhSr6V1uManX6ukDriiSc.jpg",
    "genres": [
      "Adventure",
      "Drama"
    ],
    "overview": "The story of an Indian boy named Pi, a zookeeper's son who finds himself in the company of a hyena, zebra, orangutan, and a Bengal tiger after a shipwreck sets them adrift in the Pacific Ocean."
  },
  "3116": {
    "title": "Midnight Cowboy",
    "year": "1969-05-25",
    "poster": "https://image.tmdb.org/t/p/w500/ckklq45UxUkwgHve9xItXqXr06r.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "Joe Buck is a wide-eyed hustler from Texas hoping to score big with wealthy New York City women; he finds a companion in Enrico \"Ratso\" Rizzo, an ailing swindler with a bum leg and a quixotic fantasy of escaping to Florida."
  },
  "471495": {
    "title": "World of Tomorrow Episode Two: The Burden of Other People's Thoughts",
    "year": "2017-09-22",
    "poster": "https://image.tmdb.org/t/p/w500/8nSucrEs2xZU1bXxhtMfh4imYOE.jpg",
    "genres": [
      "Science Fiction",
      "Animation",
      "Drama"
    ],
    "overview": "Emily Prime is swept into the brain of an incomplete backup clone of her future self."
  },
  "965171": {
    "title": "Ice Merchants",
    "year": "2023-02-16",
    "poster": "https://image.tmdb.org/t/p/w500/uDoiGF4KqyNglxaIJlRWdFQ4WJT.jpg",
    "genres": [
      "Animation",
      "Drama"
    ],
    "overview": "Every day, a father and his son jump with a parachute from their vertiginous cold house, attached to a cliff, to go to the village on the ground, far away where they sell the ice they produce daily."
  },
  "1184918": {
    "title": "The Wild Robot",
    "year": "2024-09-12",
    "poster": "https://image.tmdb.org/t/p/w500/wTnV3PCVW5O92JMrFvvrRcV39RU.jpg",
    "genres": [
      "Animation",
      "Science Fiction",
      "Family",
      "Adventure",
      "Drama"
    ],
    "overview": "After a shipwreck, an intelligent robot called Roz is stranded on an uninhabited island. To survive the harsh environment, Roz bonds with the island's animals and cares for an orphaned baby goose."
  },
  "1417": {
    "title": "Pan's Labyrinth",
    "year": "2006-10-11",
    "poster": "https://image.tmdb.org/t/p/w500/z7xXihu5wHuSMWymq5VAulPVuvg.jpg",
    "genres": [
      "Fantasy",
      "Drama",
      "War"
    ],
    "overview": "In post–civil war Spain, 10-year-old Ofelia moves with her pregnant mother to live under the control of her cruel stepfather. Drawn into a mysterious labyrinth, she meets a faun who reveals that she may be a lost princess from an underground kingdom. To return to her true father, she must complete a series of surreal and perilous tasks that blur the line between reality and fantasy."
  },
  "36079": {
    "title": "Tale of Tales",
    "year": "1979-01-05",
    "poster": "https://image.tmdb.org/t/p/w500/7gWBy9z4JrkDPSfG5VbjWbbgvxk.jpg",
    "genres": [
      "Animation"
    ],
    "overview": "Distant, well-worn memories of childhood are inhabited by a little gray wolf. Through astonishing imagery, the memory of all of Russia is depicted."
  },
  "758803": {
    "title": "OPAL",
    "year": "2020-10-30",
    "poster": "https://image.tmdb.org/t/p/w500/rabp6OsDUzUUcL7M5EEl4t1JnhD.jpg",
    "genres": [
      "Animation",
      "Horror",
      "Music"
    ],
    "overview": "A curious girl investigates the cries she hears coming from a forbidden house across the street."
  },
  "120467": {
    "title": "The Grand Budapest Hotel",
    "year": "2014-02-26",
    "poster": "https://image.tmdb.org/t/p/w500/eWdyYQreja6JGCzqHWXpWHDrrPo.jpg",
    "genres": [
      "Comedy",
      "Drama"
    ],
    "overview": "The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becomes his trusted protégé. The story involves the theft and recovery of a priceless Renaissance painting, the battle for an enormous family fortune and the slow and then sudden upheavals that transformed Europe during the first half of the 20th century."
  },
  "1607": {
    "title": "A Bronx Tale",
    "year": "1993-10-01",
    "poster": "https://image.tmdb.org/t/p/w500/sDbO6LmLYtyqAoFTPpRcMgPSCEO.jpg",
    "genres": [
      "Drama",
      "Crime"
    ],
    "overview": "Set in the Bronx during the tumultuous 1960s, an adolescent boy is torn between his honest, working-class father and a violent yet charismatic crime boss. Complicating matters is the youngster's growing attraction - forbidden in his neighborhood - for a beautiful black girl."
  },
  "1034716": {
    "title": "People We Meet on Vacation",
    "year": "2026-01-06",
    "poster": "https://image.tmdb.org/t/p/w500/kOrJqRyt1pklNgDwJMjzN1GuNXS.jpg",
    "genres": [
      "Romance",
      "Comedy",
      "Drama"
    ],
    "overview": "Poppy's a free spirit. Alex loves a plan. After years of summer vacations, these polar-opposite pals wonder if they could be a perfect romantic match."
  },
  "9470": {
    "title": "Kung Fu Hustle",
    "year": "2004-02-10",
    "poster": "https://image.tmdb.org/t/p/w500/exbyTbrvRUDKN2mcNEuVor4VFQW.jpg",
    "genres": [
      "Action",
      "Comedy",
      "Crime",
      "Fantasy"
    ],
    "overview": "It's the 1940s, and the notorious Axe Gang terrorizes Shanghai. Small-time criminals Sing and Bone hope to join, but they only manage to make lots of very dangerous enemies. Fortunately for them, kung fu masters and hidden strength can be found in unlikely places. Now they just have to take on the entire Axe Gang."
  },
  "1317288": {
    "title": "Marty Supreme",
    "year": "2025-12-19",
    "poster": "https://image.tmdb.org/t/p/w500/lYWEXbQgRTR4ZQleSXAgRbxAjvq.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "Marty Mauser, a young man with a dream no one respects, goes to hell and back in pursuit of greatness."
  },
  "701387": {
    "title": "Bugonia",
    "year": "2025-10-23",
    "poster": "https://image.tmdb.org/t/p/w500/rSdOua3wKMEaFWDcKAYWRjXQWOt.jpg",
    "genres": [
      "Science Fiction",
      "Thriller",
      "Comedy"
    ],
    "overview": "Two conspiracy obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth."
  },
  "43766": {
    "title": "Fireworks Wednesday",
    "year": "2006-02-08",
    "poster": "https://image.tmdb.org/t/p/w500/7PHP13zg4Ym5kzTwts6WM2xovxn.jpg",
    "genres": [
      "Drama"
    ],
    "overview": "Rouhi, a young bride-to-be, is hired as a maid for an affluent family in Tehran. Upon arriving, she is suddenly thrust into an explosive domestic conflict. The wife is convinced her husband is having an affair and enlists Rouhi as a spy, to follow her husband, and confirm her suspicions. What Rouhi discovers, however, threatens not only their marriage but her own future."
  }
}